In [2]:
import pandas
import calendar

In [2]:
df = pandas.read_csv('full.csv')

In [3]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [9]:
fltr = (df['YEAR'] <1990) | (df['YEAR'] > 2009)
df.drop(df.loc[fltr].index, inplace=True)

In [10]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
16953,1990,JAN,1,3,52,48.5,36.09,22.29,1,3.3
16954,1990,JAN,2,8,2,0.4,38.55,24.48,6,2.7
16955,1990,JAN,2,20,35,43.1,38.58,24.26,14,4.5
16956,1990,JAN,2,20,41,26.0,38.53,24.42,20,2.8
16957,1990,JAN,2,20,42,6.9,38.55,24.15,6,2.6
...,...,...,...,...,...,...,...,...,...,...
88348,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8
88349,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4
88350,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9
88351,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2
88352,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8

In [16]:
df.reset_index(inplace=True)

In [17]:
df

,index,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,16953,1990,JAN,1,3,52,48.5,36.09,22.29,1,3.3
1,16954,1990,JAN,2,8,2,0.4,38.55,24.48,6,2.7
2,16955,1990,JAN,2,20,35,43.1,38.58,24.26,14,4.5
3,16956,1990,JAN,2,20,41,26.0,38.53,24.42,20,2.8
4,16957,1990,JAN,2,20,42,6.9,38.55,24.15,6,2.6
...,...,...,...,...,...,...,...,...,...,...,...
71395,88348,2009,DEC,31,14,24,1.2,37.47,21.83,21,2.8
71396,88349,2009,DEC,31,14,50,29.6,34.67,24.42,15,3.4
71397,88350,2009,DEC,31,17,27,45.8,35.68,23.47,5,2.9
71398,88351,2009,DEC,31,20,43,12.9,36.37,21.61,11,3.2
71399,88352,2009,DEC,31,20,58,40.8,39.70,20.76,18,2.8

In [22]:
df.drop(columns=['index'], inplace=True)

In [19]:
df['MONTH'].str.title()

0        Jan
1        Jan
2        Jan
3        Jan
4        Jan
        ...
71395    Dec
71396    Dec
71397    Dec
71398    Dec
71399    Dec
Name: MONTH, Length: 71400, dtype: object

In [23]:
df['MONTH'] = df['MONTH'].str.title()

In [24]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1990,Jan,1,3,52,48.5,36.09,22.29,1,3.3
1,1990,Jan,2,8,2,0.4,38.55,24.48,6,2.7
2,1990,Jan,2,20,35,43.1,38.58,24.26,14,4.5
3,1990,Jan,2,20,41,26.0,38.53,24.42,20,2.8
4,1990,Jan,2,20,42,6.9,38.55,24.15,6,2.6
...,...,...,...,...,...,...,...,...,...,...
71395,2009,Dec,31,14,24,1.2,37.47,21.83,21,2.8
71396,2009,Dec,31,14,50,29.6,34.67,24.42,15,3.4
71397,2009,Dec,31,17,27,45.8,35.68,23.47,5,2.9
71398,2009,Dec,31,20,43,12.9,36.37,21.61,11,3.2
71399,2009,Dec,31,20,58,40.8,39.70,20.76,18,2.8

In [32]:
month_abbr_as_ints = dict((x,y) for (y,x) in enumerate(calendar.month_abbr))
month_abbr_as_ints

{'': 0,
 'Jan': 1,
 'Feb': 2,
 'Mar': 3,
 'Apr': 4,
 'May': 5,
 'Jun': 6,
 'Jul': 7,
 'Aug': 8,
 'Sep': 9,
 'Oct': 10,
 'Nov': 11,
 'Dec': 12}

In [33]:
df['MONTH'].replace(month_abbr_as_ints, inplace=True)

In [34]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1990,1,1,3,52,48.5,36.09,22.29,1,3.3
1,1990,1,2,8,2,0.4,38.55,24.48,6,2.7
2,1990,1,2,20,35,43.1,38.58,24.26,14,4.5
3,1990,1,2,20,41,26.0,38.53,24.42,20,2.8
4,1990,1,2,20,42,6.9,38.55,24.15,6,2.6
...,...,...,...,...,...,...,...,...,...,...
71395,2009,12,31,14,24,1.2,37.47,21.83,21,2.8
71396,2009,12,31,14,50,29.6,34.67,24.42,15,3.4
71397,2009,12,31,17,27,45.8,35.68,23.47,5,2.9
71398,2009,12,31,20,43,12.9,36.37,21.61,11,3.2
71399,2009,12,31,20,58,40.8,39.70,20.76,18,2.8

In [36]:
df['T'] = (
    df['YEAR'].astype(str) + '-' + 
    df['MONTH'].astype(str) + '-' +
    df['DAY'].astype(str) + ' ' +
    df['HOUR'].astype(str) + ':' +
    df['MINUTE'].astype(str) + ':' +
    df['SECOND'].astype(str)
)

In [37]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
0,1990,1,1,3,52,48.5,36.09,22.29,1,3.3,1990-1-1 3:52:48.5
1,1990,1,2,8,2,0.4,38.55,24.48,6,2.7,1990-1-2 8:2:0.4
2,1990,1,2,20,35,43.1,38.58,24.26,14,4.5,1990-1-2 20:35:43.1
3,1990,1,2,20,41,26.0,38.53,24.42,20,2.8,1990-1-2 20:41:26.0
4,1990,1,2,20,42,6.9,38.55,24.15,6,2.6,1990-1-2 20:42:6.9
...,...,...,...,...,...,...,...,...,...,...,...
71395,2009,12,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31 14:24:1.2
71396,2009,12,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31 14:50:29.6
71397,2009,12,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31 17:27:45.8
71398,2009,12,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31 20:43:12.9
71399,2009,12,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31 20:58:40.8

In [38]:
df['T'] = pandas.to_datetime(df['T'])

In [39]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE,T
0,1990,1,1,3,52,48.5,36.09,22.29,1,3.3,1990-01-01 03:52:48.500
1,1990,1,2,8,2,0.4,38.55,24.48,6,2.7,1990-01-02 08:02:00.400
2,1990,1,2,20,35,43.1,38.58,24.26,14,4.5,1990-01-02 20:35:43.100
3,1990,1,2,20,41,26.0,38.53,24.42,20,2.8,1990-01-02 20:41:26.000
4,1990,1,2,20,42,6.9,38.55,24.15,6,2.6,1990-01-02 20:42:06.900
...,...,...,...,...,...,...,...,...,...,...,...
71395,2009,12,31,14,24,1.2,37.47,21.83,21,2.8,2009-12-31 14:24:01.200
71396,2009,12,31,14,50,29.6,34.67,24.42,15,3.4,2009-12-31 14:50:29.600
71397,2009,12,31,17,27,45.8,35.68,23.47,5,2.9,2009-12-31 17:27:45.800
71398,2009,12,31,20,43,12.9,36.37,21.61,11,3.2,2009-12-31 20:43:12.900
71399,2009,12,31,20,58,40.8,39.70,20.76,18,2.8,2009-12-31 20:58:40.800

In [42]:
df.drop(columns = ['YEAR', 'MONTH', 'DAY', 'HOUR', 'MINUTE', 'SECOND'], inplace = True)

In [43]:
df

       LATITUDE  LONGITUDE  DEPTH  MAGNITUDE                       T
0         36.09      22.29      1        3.3 1990-01-01 03:52:48.500
1         38.55      24.48      6        2.7 1990-01-02 08:02:00.400
2         38.58      24.26     14        4.5 1990-01-02 20:35:43.100
3         38.53      24.42     20        2.8 1990-01-02 20:41:26.000
4         38.55      24.15      6        2.6 1990-01-02 20:42:06.900
...         ...        ...    ...        ...                     ...
71395     37.47      21.83     21        2.8 2009-12-31 14:24:01.200
71396     34.67      24.42     15        3.4 2009-12-31 14:50:29.600
71397     35.68      23.47      5        2.9 2009-12-31 17:27:45.800
71398     36.37      21.61     11        3.2 2009-12-31 20:43:12.900
71399     39.70      20.76     18        2.8 2009-12-31 20:58:40.800

[71400 rows x 5 columns]

In [47]:
df.index.name = 'Event'

In [48]:
df

       LATITUDE  LONGITUDE  DEPTH  MAGNITUDE                       T
Event
0         36.09      22.29      1        3.3 1990-01-01 03:52:48.500
1         38.55      24.48      6        2.7 1990-01-02 08:02:00.400
2         38.58      24.26     14        4.5 1990-01-02 20:35:43.100
3         38.53      24.42     20        2.8 1990-01-02 20:41:26.000
4         38.55      24.15      6        2.6 1990-01-02 20:42:06.900
...         ...        ...    ...        ...                     ...
71395     37.47      21.83     21        2.8 2009-12-31 14:24:01.200
71396     34.67      24.42     15        3.4 2009-12-31 14:50:29.600
71397     35.68      23.47      5        2.9 2009-12-31 17:27:45.800
71398     36.37      21.61     11        3.2 2009-12-31 20:43:12.900
71399     39.70      20.76     18        2.8 2009-12-31 20:58:40.800

[71400 rows x 5 columns]

In [53]:
df.rename(columns = {'LATITUDE': 'Latitude', 'LONGITUDE': 'Longitude', 'DEPTH': 'Depth', 'MAGNITUDE': 'Magnitude', 'T': 'Time'}, inplace=True)

In [54]:
df

       Latitude  Longitude  Depth  Magnitude                    Time
Event
0         36.09      22.29      1        3.3 1990-01-01 03:52:48.500
1         38.55      24.48      6        2.7 1990-01-02 08:02:00.400
2         38.58      24.26     14        4.5 1990-01-02 20:35:43.100
3         38.53      24.42     20        2.8 1990-01-02 20:41:26.000
4         38.55      24.15      6        2.6 1990-01-02 20:42:06.900
...         ...        ...    ...        ...                     ...
71395     37.47      21.83     21        2.8 2009-12-31 14:24:01.200
71396     34.67      24.42     15        3.4 2009-12-31 14:50:29.600
71397     35.68      23.47      5        2.9 2009-12-31 17:27:45.800
71398     36.37      21.61     11        3.2 2009-12-31 20:43:12.900
71399     39.70      20.76     18        2.8 2009-12-31 20:58:40.800

[71400 rows x 5 columns]

In [3]:
df_direct = pandas.read_csv('full.txt', header=None, skiprows=2, sep='\s+', names=['year', 'month', 'day', 'hour', 'minute', 'second', 'latitude', 'lotitude', 'depth', 'magnitude'])

In [4]:
df_direct

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [5]:
df_direct.index.name = 'event'

In [6]:
df_direct

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
event,,,,,,,,,,
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2